

/* 🔹 МАТЕМАТИКА*/
const math = [
    
    {id:1, sub:"Математика", q:"Скільки всього цілих чисел містить інтервал (-2,07; 15,9)?", a:["19","15","13","17","18"], correct:4, points:1},

    {id:2, sub:"Математика",
    q:"Кінетичну енергію $E$ тіла масою $m$, яке рухається зі швидкістю $v$, обчислюють за формулою $E = \\frac{mv^2}{2}$. Виразіть $m$ із цієї формули.",
    a:[
        "$m = \\frac{2E}{v^2}$",
        "$m = \\frac{v^2}{2E}$",
        "$m = \\frac{E}{2v^2}$",
        "$m = \\frac{2v^2}{E}$",
        "$m = \\frac{2}{Ev^2}$"
    ],
    correct:0,
    points:1
    },    
    {id:3, sub:"Математика", 
    q:"На рисунку зображено правильну чотирикутну піраміду SABCD з вершиною S. У цій піраміді SA є", 
    img:"images/pyramid.png",
    a:["ребром основи","апофемою","висотою","бічним ребром","висотою основи"], 
    correct:3, points:1},
    
    {id:4, sub:"Математика", q:"Укажіть проміжок, якому належить корінь рівняння (3/8)^x = 8/3.", a:["(-6; -4)","(-4; -2)","(-2; 0)","(0; 2)","(2; 4)"], correct:2, points:1},
    
    {id:5, sub:"Математика", q:"Площа бічної поверхні циліндра дорівнює 24π, а довжина кола його основи — 4π. Визначте висоту цього циліндра.", a:["2","3","4","6","8"], correct:3, points:1},
    
    {id:6, sub:"Математика",
    q:"На рисунку зображено графік квадратичної функції. Локальним екстремумом цієї функції є",
    img:"images/parabola.png",
    a:["x₀ = 4","x₀ = 0","x₀ = 1","x₀ = 3","x₀ = -1"],
    correct:2, points:1},
    
    {id:7, sub:"Математика", q:"Протягом хокейного матчу команда господарів володіла шайбою 3/5 від усього ігрового часу, а команда гостей — решту ігрового часу. Яку частку (%) від усього ігрового часу команда гостей володіла шайбою?", a:["75%","40%","60%","25%","20%"], correct:1, points:1},
    
    {id:8, sub:"Математика", q:"Задано довільний трикутник ABC, у якому AM — медіана. Які з наведених тверджень правильні? I. BM = MC. II. ∠BAM = ∠MAC. III. Площа трикутника ABM дорівнює площі трикутника MCA.", a:["лише I","лише III","лише II та III","лише I та III","I, II та III"], correct:3, points:1},
    
    {id:9, sub:"Математика", q:"Спростіть вираз (3x²y) / (9xy³).", a:["27x³y⁴","x³y⁴/3","3x/y²","x³/3y⁴","x/3y²"], correct:4, points:1},
    
    {id:10, sub:"Математика", q:"Розв’яжіть систему рівнянь: x/(2y) = -3, x + y = 10. Якщо (x₀; y₀) — розв’язок цієї системи, то x₀ =", a:["-2","2","4","12","-12"], correct:3, points:1},
    
    {id:11, sub:"Математика", q:"Спростіть вираз (a² − 1)(a + 1) / (a² + 2a + 1).", a:["1 − a","(a + 1)/(a − 1)","(a − 1)/2","a + 1","a − 1"], correct:4, points:1},
    
    {id:12, sub:"Математика",
    q:"У рівнобічній трапеції ABCD (AB = CD) на більшій основі AD вибрано точку O так, що AO = OD, ∠AOB = 45°. AD : BC = 5 : 2, AD = b. Знайдіть площу цієї трапеції.",
    img:"images/trapezoid.png",
    a:["7b²/25","7b²√2/50","21b²/100","7b²/50","7b²/45"],
    correct:3,points:1},
    
    {id:13, sub:"Математика",
    q:"У геометричній прогресії (bₙ) b₁ = 5, b₃ = b₄ / 10. Визначте b₃.",
    a:["50","2","0,05","500","0,5"],
    correct:3,
    points:1
    },
    
    {id:14, sub:"Математика",
    q:"За якою формулою можна обчислити об’єм V правильної чотирикутної піраміди, сторона основи і висота якої дорівнюють a?",
    a:["V = a³/4","V = a³","V = a³/3","V = √5a²","V = √3a²"],
    correct:2, points:1},
    
    {id:15, sub:"Математика",
    q:"Спростіть вираз (1 − sin² α) · tg² α.",
    a:["sin 2α","cos 2α","cos⁴ α / sin² α","sin² α","ctg² α"],
    correct:3, points:1},
    
    {id:16, sub:"Математика",
    q:"До кожного початку речення (1–3) доберіть його закінчення (А–Д) так, щоб утворилося правильне твердження.",
    type:"match",
    left:[
    "Функція y = √(x − 4)",
    "Функція y = x + 4",
    "Функція y = x³"
    ],
    right:[
    "спадає на проміжку (−∞; +∞)",
    "невизначена в точці x = 1",
    "є парною",
    "набуває додатного значення в точці x = −3",
    "є непарною"
    ],
    correct:["Б","Г","Д"], points:3
    },
    
    {id:17, sub:"Математика",
    q:"Узгодьте вираз (1–3) із його значенням (А–Д).",
    type:"match",
    left:[
    "sin(-π/6)",
    "π − |π + 2|",
    "(-1/√2)²"
    ],
    right:[
    "-1/2",
    "1/2",
    "2",
    "-2",
    "√2"
    ],
    correct:["А","Г","Б"], points:3
    },
    
    {id:18, sub:"Математика",
    q:"На рисунку зображено прямокутну трапецію ABCD, у якій AC = CD = 15 см, BC = 12 см. O — середина діагоналі AC трапеції ABCD. До відрізка (1–3) доберіть його довжину (А–Д).",
    img:"images/trapezoid2.png",
    type:"match",
    left:[
    "OB",
    "AB",
    "середня лінія трапеції ABCD"
    ],
    right:[
    "7,5 см",
    "8 см",
    "9 см",
    "15 см",
    "18 см"
    ],
    correct:["А","В","Д"], points:3
    },
    
    {id:19, sub:"Математика",
    q:"Графіки функцій y = f(x) і y = x² − 2x + 3 перетинаються в точках з абсцисами x₁ = 0 і x₂ = 3. Обчисліть площу зафарбованої фігури, якщо ∫₀³ f(x) dx = 14,1.",
    img:"images/integral.png",
    type:"input",
    correct:5.1, points:2},
    
    {id:20, sub:"Математика",
    q:"У торбинці лежать 3 цукерки з молочного шоколаду та t цукерок з чорного шоколаду. Усі цукерки однакової форми й розміру. Якого найменшого значення може набувати t, якщо ймовірність навмання витягти з торбинки цукерку з молочного шоколаду менша за 0,25?",
    type:"input",
    correct:10, points:2},
    
    {id:21, sub:"Математика",
    q:"Основою прямої призми є ромб із гострим кутом 60°. Висота призми дорівнює 8√3, площа її більшого діагонального перерізу – 240√3. Обчисліть площу бічної поверхні цієї призми.",
    type:"input",
    correct:960, points:2},
    
    {id:22, sub:"Математика",
    q:"Знайдіть найменше ціле значення параметра a, при якому рівняння √(x² − 5x) + √(x² − 9x + 20) = √a · √(x − 5) має два корені.",
    type:"input",
    correct:11,points:2},

];

/* 🔹 УКРАЇНСЬКА МОВА*/
const ukr = [

    {id:101, sub:"Українська мова",
    q:"Однаковий звук позначають букви, виділені в кожному слові рядка",
        a:[
            "здає<span class='hl'>ть</span>ся, моло<span class='hl'>т</span>ьба, ба<span class='hl'>ть</span>ко",
            "рю<span class='hl'>к</span>зак, а<span class='hl'>ґ</span>рус, <span class='hl'>ґ</span>рунтознавець",
            "контрас<span class='hl'>т</span>ний, шіс<span class='hl'>т</span>десят, че<span class='hl'>т</span>вер",
            "подру<span class='hl'>ж</span>ка, ду<span class='hl'>ж</span>ечка, д<span class='hl'>ж</span>гутовий"
        ],
        correct:1,
        points:1
        },

    { id:102, sub:"Українська мова",
    q:"Правильно виділено букви на позначення наголошених голосних у всіх словах рядка, ОКРІМ",
    a:[
        "фахов<b>и</b>й катал<b>о</b>г, багатор<b>а</b>зові витр<b>а</b>ти",
        "д<b>и</b>влячись у дов<b>і</b>дник, завчас<b>у</b>&nbsp;занест<b>и</b>",
        "нов<b>і</b> жалюз<b>і</b>, зобраз<b>и</b>ти триз<b>у</b>б",
        "щодобов<b>е</b> завд<b>а</b>ння, кор<b>и</b>сна кропив<b>а</b>"
    ],
        correct:0,
        points:1
    },

    {id:103,sub:"Українська мова",
    q:"Подвоєні букви треба писати у формі орудного відмінка однини в усіх словах рядка",
    a:[
        "верф, паралель, подорож, ціль",
        "папороть, сіль, велич, стриманість",
        "кров, заметіль, емаль, світлотінь",
        "магістраль, мазь, мігрень, мідь"
        ],
        correct:3,
        points:1
    },

    { id:104, sub:"Українська мова",
    q:"Апостроф треба писати на місці пропуску в усіх словах рядка, ОКРІМ",
    a:[
        "між..ярусний, сузір..я, розм..якшити",
        "під..юджувати, солов..їний, стерв..ятник",
        "верб..я, подзв..якувати, перем..ятий",
        "підв..ялений, арф..ярка, роз..їхатися"
        ],
    correct:2,
    points:1
    },

    {id:105, sub:"Українська мова",
    q:"Разом треба писати всі слова в рядку",
    a:[
        "на/чисто, з/ранку, в/основному",
        "у/літку, по/тихеньку, на/вічно",
        "без/упину, на/весні, від/тоді",
        "до/нині, за/надто, до/вподоби"
    ],
    correct:1,
    points:1
    },

    {id:106, sub:"Українська мова",
    q:"Букву у треба писати на місці пропуску в усіх словах рядка",
    a:[
        "тр..вожний, абр..кос, м..тушливий",
        "мер..діан, теор..тичний, др..жати",
        "см..ренний, хр..стиянин, м..телик",
        "х..мерний, завм..рання, д..ригент"
    ],
    correct:3,
    points:1
    },

    {id:107, sub:"Українська мова",
    q:"Префікс с- треба писати в усіх словах рядка",
    a:[
        "..товщення, ..жалитися, ..поєний",
        "..качати, ..формувати, ..поконвіків",
        "..підлоба, ..чеплений, ..касування",
        "..ціджений, ..худнути, ..тягнення"
    ],
    correct:0,
    points:1
    },

    {id:108, sub:"Українська мова",
    q:"Немає орфографічних помилок у варіанті",
    a:[
        "Щоб почуватися щастливими, не потрібно шукати перо жарптиці: ви маєте лише дотримуватися кількох простих порад, перетворивши їх на щоденні ритуали.",
        "Починаймо кожен ранок із подяки за все, що маємо, атже так ми вчимося цінувати дорогоцінні миті, відчуваємо любов та турботу рідних, помічаємо щедрість світу.",
        "Щодня знаходьмо джерело радості, щоб наповнитися силою, накопичити позитивну енергію для нових справ, подолання тимчасових труднощів і підкорення вершин.",
        "Поважаймо не лише власний вибір, а й погляди та периконання інших людей, щохвилинно пам’ятаючи, що кожен із нас має не заперечне право бути собою."
    ],
    correct:2,
    points:1
    },

    { id:109, sub:"Українська мова",
    q:"Префікс від- має однакове значення в усіх словах, ОКРІМ",
    a:[
        "відбігти",
        "відробити",
        "відлетіти",
        "відповзти"
    ],
    correct:1,
    points:1
    },

    {id:110, sub:"Українська мова",
    q:"Лексична помилка є в рядку",
    a:[
        "підбити підсумки",
        "ухвалити рішення",
        "співставити факти",
        "здійснити перевірку"
    ],
    correct:2,
    points:1
    },

    { id:111, sub:"Українська мова",
    q:"Редагування потребує речення",
    a:[
        "Беручи в руки звичайний олівець з гумкою, ви ніколи не подумаєте, що людство витратило на цей винахід близько тисячоліття.",
        "Ще стародавні греки послуговувалися графітовими паличками, використовуючи їх для малювання.",
        "Потім секрет виготовлення було втрачено, і лише ураганом 1565 року, промчавши англійським графством Камберленд, було відкрито родовище невідомого матеріалу – графіту.",
        "У 1858-му році Хаймен Ліпман з Філадельфії запатентував олівець з гумкою, відтак кожен отримав можливість писати, відразу витираючи помилки.",
        "Цікаво, що експериментатори використали до кінця один олівець середньої твердості, написавши 45 тисяч слів."
    ],
    correct:2,
    points:1
    },

    { id:112, sub:"Українська мова",
    q:"НЕПРАВИЛЬНО оформлено пряму мову в реченні",
    a:[
        "«Хто просувається в науках, але відстає в моралі, той іде радше назад, ніж уперед!» – наголошував знаний давньогрецький філософ Аристотель.",
        "Відомий педагог Василь Сухомлинський писав: «Самовиховання потребує кількох важливих могутніх стимулів: почуття власної гідності, поваги до себе, бажання стати сьогодні кращим, ніж був учора».",
        "«Фізкультура повернула мені все: серце, гнучкість, витривалість! – говорив учений-медик Микола Амосов і наголошував: – Але головне – працездатність, мабуть, найдорожче з усього, чим живе людина».",
        "«Щоб стати особистістю, – стверджував український філософ Іван Бойченко, – потрібно знайти, виховати й навчити себе, визначити власне місце в суспільстві, стати його частиною і чинити гідно».",
        "«Найкращою характеристикою людини є мета, якої вона прагне» – уважав римський філософ Марк Аврелій."
    ],
    correct:4,
    points:1
    },

    { id:113, sub:"Українська мова",
    q:"<i>Серіал «І будуть люди» побудовано у формі саги,(1) і в ній крізь призму життя звичайних людей показано турбулентні етапи ХХ століття.(2) Першу світову війну,(3) прихід радянської влади,(4) жахи кожного героя сприйняв з позиції власної правди,(5) проте всіх дійових осіб об’єднало бажання знайти своє місце в новому історичному вимірі.<i><br><br>НЕПРАВИЛЬНИМ є обґрунтування вживання розділових знаків у рядку",
    a:[
        "кома 1 — між частинами складного речення, що поєднані сурядним зв’язком",
        "двокрапка 2 — після узагальнювального слова",
        "кома 3 — при однорідних членах речення",
        "кома 4 — між частинами складного речення, що поєднані підрядним зв’язком",
        "кома 5 — між частинами складного речення, що поєднані безсполучниковим зв’язком"
    ],
    correct:3,
    points:1
    },

    { id:114, sub:"Українська мова",
    q:"Немає лексичної помилки в реченні",
    a:[
        "Чиста совість мотивує людину на вчинки, які ніколи не змусять жалкувати про здійснене.",
        "Багато хто з нас мріяв добитися великого успіху й зайняти вище місце в суспільному житті.",
        "Часто ми не приділяємо значення відношенням з людьми, що, однак, розкривають суть і нашого «Я».",
        "Коли посторонні люди зауважать наші позитивні риси, це тішить і надихає на гарні вчинки.",
        "Кожна слідуюча сходинка життя опирається на результати нашого попереднього розвитку."
    ],
    correct:0,
    points:1
    },

    { id:115, sub:"Українська мова",
    q:"Синонімом до слова <i>достойний</i> є",
    a:[
        "гідний",
        "схожий",
        "певний",
        "цінний",
        "вартісний"
    ],
    correct:0,
    points:1
    },
    
    { id:116, sub:"Українська мова",
    q:"<i>Медичний безпілотник набирає швидкість близько ______ кілометрів за годину й підвищує шанси на виживання під час серцевого нападу ______ відсотків.</i>",
    a:[
        "дев’яносто, від восьми до вісімдесяти",
        "дев’яноста, від вісьми до восьмидесяти",
        "дев’яноста, від восьми до восьмидесятих",
        "дев’яносто, від вісьми до вісімдесяти",
        "дев’яноста, від восьми до вісімдесяти"
    ],
    correct:4,
    points:1
    },

    { id:117, sub:"Українська мова",
    q:"<i>Повідомляти ______ курсів водіння про ______ наслідки порушень на автошляхах так само важливо, як і навчати ______ дорожнього руху.</i>",
    a:[
        "слухачам, самі ймовірні, правил",
        "слухачів, найбільш ймовірніші, правилам",
        "слухачів, найімовірніші, правил",
        "слухачам, найімовірні, правилам",
        "слухачів, найбільш ймовірні, правилам"
    ],
    correct:1,
    points:1
    },

    { id:118, sub:"Українська мова",
    q:"<i>__________, сестра знову експериментувала на кухні й приготувала кольрабі, __________ у вершковому соусі.</i>",
    a:[
        "Андрію, тушковану",
        "Андрію, тушковану",
        "Андріє, тушковане",
        "Андрію, тушковане",
        "Андріє, тушкований"
    ],
    correct:2,
    points:1
    },

    {id:119, sub:"Українська мова",
    q:"<i>Демонстрація модних ______ нової колекції ______ відбудеться через ______.</i>",
    a:[
        "пальт, Тараса Демиденка, півтори місяці",
        "пальто, Тараса Демиденка, півтора місяця",
        "пальто, Тараса Демиденка, півтора місяців",
        "пальт, Тараса Демиденко, півтора місяці",
        "пальт, Тараса Демиденка, півтора місяця"
    ],
    correct:4,
    points:1
    },

    {id:120, sub:"Українська мова",
    q:"<i>Цьогоріч ______ чотири ______ смородини на ______ ділянку, а любисток, навпаки, – у затінок.</i>",
    a:[
        "пересаджу, куща, більш світлу",
        "пересаджу, кущі, більш світлішу",
        "пересаджу, куща, більш світлу",
        "пересаджу, кущі, світлішу",
        "пересаджу, кущів, світлішу"
    ],
    correct:3,
    points:1
    },

    { id:121, sub:"Українська мова",
    q:`<i>
    <span class="shape">◇</span> &nbsp; Визначаючись з інвестуванням, зважають на незалежність вартості вибраного об’єкта від політичної ситуації в державі, захищеність від утручання третіх сторін у процес володіння та розпорядження ним тощо.<br><br>

    <span class="shape">□</span> &nbsp; Таку ситуацію пояснюють нестабільністю курсів, тому громадяни прагнуть вкладати кошти в іноземну валюту, коштовні речі, нерухомість та дорогоцінні метали.<br><br>

    <span class="shape">○</span> &nbsp; Отже, цифрова валюта стає популярною в деяких країнах, відтак формують інфраструктуру її продажу через термінали, розширюють мережу комерційних і виробничих структур, які уможливлюють розрахунок електронними грошима.<br><br>

    <span class="shape">▽</span> &nbsp; Останнім часом дедалі частіше, що базовим критеріям відповідає новий інструмент фінансового ринку — електронні гроші, основними перевагами яких є конфіденційність, незалежність від держави, відсутність територіальних і часових обмежень у трансакціях, низька вартість обслуговування.<br><br>

    <span class="shape">△</span> &nbsp; У період поглиблення кризових явищ у світовій економіці, люди в багатьох країнах часто уникають заощаджень у національних грошових одиницях.
    </i><br><br>

    Первісний текст буде відновлено, якщо речення розташувати в послідовності, запропонованій у рядку`,
    a:[
        "<span class='shape'>△</span>&nbsp;<span class='shape'>□</span>&nbsp;<span class='shape'>◇</span>&nbsp;<span class='shape'>▽</span>&nbsp;<span class='shape'>○</span>",
        "<span class='shape'>△</span>&nbsp;<span class='shape'>○</span>&nbsp;<span class='shape'>▽</span>&nbsp;<span class='shape'>◇</span>&nbsp;<span class='shape'>□</span>",
        "<span class='shape'>△</span>&nbsp;<span class='shape'>◇</span>&nbsp;<span class='shape'>□</span>&nbsp;<span class='shape'>▽</span>&nbsp;<span class='shape'>○</span>",
        "<span class='shape'>△</span>&nbsp;<span class='shape'>○</span>&nbsp;<span class='shape'>◇</span>&nbsp;<span class='shape'>▽</span>&nbsp;<span class='shape'>□</span>",
        "<span class='shape'>△</span>&nbsp;<span class='shape'>□</span>&nbsp;<span class='shape'>▽</span>&nbsp;<span class='shape'>◇</span>&nbsp;<span class='shape'>○</span>"
    ],
    correct:0,
    points:1
    },

    {id:122, sub:"Українська мова",
    q:`<i>
    <span class="shape">◇</span> &nbsp; Визначаючись з інвестуванням, зважають на незалежність вартості вибраного об’єкта від політичної ситуації в державі, захищеність від утручання третіх сторін у процес володіння та розпорядження ним тощо.<br><br>

    <span class="shape">□</span> &nbsp; Таку ситуацію пояснюють нестабільністю курсів, тому громадяни прагнуть вкладати кошти в іноземну валюту, коштовні речі, нерухомість та дорогоцінні метали.<br><br>

    <span class="shape">○</span> &nbsp; Отже, цифрова валюта стає популярною в деяких країнах, відтак формують інфраструктуру її продажу через термінали, розширюють мережу комерційних і виробничих структур, які уможливлюють розрахунок електронними грошима.<br><br>

    <span class="shape">▽</span> &nbsp; Останнім часом дедалі частіше, що базовим критеріям відповідає новий інструмент фінансового ринку — електронні гроші, основними перевагами яких є конфіденційність, незалежність від держави, відсутність територіальних і часових обмежень у трансакціях, низька вартість обслуговування.<br><br>

    <span class="shape">△</span> &nbsp; У період поглиблення кризових явищ у світовій економіці, люди в багатьох країнах часто уникають заощаджень у національних грошових одиницях.
    </i><br><br>

    Пунктуаційна помилка є в реченні, позначеному`,
    a:[
        "<span class='shape'>◇</span>",
        "<span class='shape'>□</span>",
        "<span class='shape'>○</span>",
        "<span class='shape'>▽</span>",
        "<span class='shape'>△</span>"
    ],
    correct:4,
    points:1
    }, 
    
    { id:123, sub:"Українська мова",
    q:`<i>
    <span class="shape">◇</span> &nbsp; Визначаючись з інвестуванням, зважають на незалежність вартості вибраного об’єкта від політичної ситуації в державі, захищеність від утручання третіх сторін у процес володіння та розпорядження ним тощо.<br><br>

    <span class="shape">□</span> &nbsp; Таку ситуацію пояснюють нестабільністю курсів, тому громадяни прагнуть вкладати кошти в іноземну валюту, коштовні речі, нерухомість та дорогоцінні метали.<br><br>

    <span class="shape">○</span> &nbsp; Отже, цифрова валюта стає популярною в деяких країнах, відтак формують інфраструктуру її продажу через термінали, розширюють мережу комерційних і виробничих структур, які уможливлюють розрахунок електронними грошима.<br><br>

    <span class="shape">▽</span> &nbsp; Останнім часом дедалі частіше, що базовим критеріям відповідає новий інструмент фінансового ринку — електронні гроші, основними перевагами яких є конфіденційність, незалежність від держави, відсутність територіальних і часових обмежень у трансакціях, низька вартість обслуговування.<br><br>

    <span class="shape">△</span> &nbsp; У період поглиблення кризових явищ у світовій економіці, люди в багатьох країнах часто уникають заощаджень у національних грошових одиницях.
    </i><br><br>

    Прикладка є в реченні, позначеному`,
    a:[
        "<span class='shape'>◇</span>",
        "<span class='shape'>□</span>",
        "<span class='shape'>○</span>",
        "<span class='shape'>▽</span>",
        "<span class='shape'>△</span>"
    ],
    correct:3,
    points:1
    },

    { id:124, sub:"Українська мова",
    q:`<i>
    <span class="shape">◇</span> &nbsp; Визначаючись з інвестуванням, зважають на незалежність вартості вибраного об’єкта від політичної ситуації в державі, захищеність від утручання третіх сторін у процес володіння та розпорядження ним тощо.<br><br>

    <span class="shape">□</span> &nbsp; Таку ситуацію пояснюють нестабільністю курсів, тому громадяни прагнуть вкладати кошти в іноземну валюту, коштовні речі, нерухомість та дорогоцінні метали.<br><br>

    <span class="shape">○</span> &nbsp; Отже, цифрова валюта стає популярною в деяких країнах, відтак формують інфраструктуру її продажу через термінали, розширюють мережу комерційних і виробничих структур, які уможливлюють розрахунок електронними грошима.<br><br>

    <span class="shape">▽</span> &nbsp; Останнім часом дедалі частіше, що базовим критеріям відповідає новий інструмент фінансового ринку — електронні гроші, основними перевагами яких є конфіденційність, незалежність від держави, відсутність територіальних і часових обмежень у трансакціях, низька вартість обслуговування.<br><br>

    <span class="shape">△</span> &nbsp; У період поглиблення кризових явищ у світовій економіці, люди в багатьох країнах часто уникають заощаджень у національних грошових одиницях.
    </i><br><br>

    Однорідні підмети є в реченні, позначеному`,
    a:[
        "<span class='shape'>◇</span>",
        "<span class='shape'>□</span>",
        "<span class='shape'>○</span>",
        "<span class='shape'>▽</span>",
        "<span class='shape'>△</span>"
    ],
    correct:3,
    points:1
    },

    { id:125, sub:"Українська мова",
    q:`<i>
    <span class="shape">◇</span> &nbsp; Визначаючись з інвестуванням, зважають на незалежність вартості вибраного об’єкта від політичної ситуації в державі, захищеність від <b>утручання</b> третіх сторін у <b>процес</b> володіння та розпорядження ним тощо.<br><br>

    <span class="shape">□</span> &nbsp; Таку ситуацію пояснюють нестабільністю курсів, тому громадяни прагнуть вкладати <b>кошти</b> в іноземну валюту, коштовні речі, нерухомість та дорогоцінні метали.<br><br>

    <span class="shape">○</span> &nbsp; Отже, цифрова валюта стає популярною в деяких країнах, відтак формують інфраструктуру її продажу через <b>термінали</b>, розширюють мережу комерційних і виробничих структур, які уможливлюють розрахунок електронними грошима.<br><br>

    <span class="shape">▽</span> &nbsp; Останнім часом дедалі частіше, що базовим критеріям відповідає новий інструмент фінансового ринку — електронні гроші, основними перевагами яких є конфіденційність, незалежність від держави, відсутність територіальних і часових обмежень у трансакціях, низька вартість обслуговування.<br><br>

    <span class="shape">△</span> &nbsp; У <b>період</b> поглиблення кризових явищ у світовій економіці, люди в багатьох країнах часто уникають заощаджень у національних грошових одиницях.
    </i><br><br>

    У формі знахідного відмінка вжито всі слова, ОКРІМ`,
    a:[
        "утручання",
        "процес",
        "кошти",
        "термінали",
        "період"
    ],
    correct:0,
    points:1
    },

    {id:126, sub:"Українська мова",
    q:"Доберіть до кожного речення (1–4), у якому зроблено пропуск, відповідний за значенням фразеологізм (А–Д).",
    type:"match",

    left:[
        " Коли вирішуєте [...] приготування їжі, варто враховувати індивідуальні потреби й смакові вподобання кожного члена родини.",
        " Рекомендуємо назавжди [...] складаючи меню на тиждень, одночасно плануйте список того, що треба купити.",
        " Наявність плану харчування й списку покупок допомагає [...] та не блукати між вітринами в пошуках необхідного.",
        " Готуйте для рідних із задоволенням, експериментуйте і можете не [...] іноді невдалих результатів кулінарних експромтів."
    ],

    right:[
        "взяти віжки",
        "взяти на себе",
        "взяти голову в руки",
        "брати близько до серця",
        "брати ноги на плечі"
    ],

    correct:{
    1:1,
    2:0,
    3:2,
    4:3
    },

    points:4
    },

    {id:127, sub:"Українська мова",
    q:`<i>З’ясуйте, якою частиною мови (А – Д) є виділене в реченні слово (1–4) (цифра позначає наступне слово).</i><br><br>
    На полях, <b>(1) що</b> розстилалися <b>(2) обабіч</b>, чулися невиразні шерхи: <b>(3) то</b> тріск сухого бур’яну, то пригасене <b>(4) шарудіння</b>.`,
    type:"match",

    left:[
        " що",
        " обабіч",
        " то",
        " шарудіння"
    ],

    right:[
        "іменник",
        "займенник",
        "прислівник",
        "прийменник",
        "сполучник"
    ],

    correct:{
    1:4,
    2:2,
    3:1,
    4:0
    },

    points:4
    },

    { id:128, sub:"Українська мова",
    q:`Поєднайте виділений фрагмент простого (1–4) і складного (А – Д) речення за подібністю синтаксичного значення. Зразок такого поєднання показано на схемі.`,
    img:"images/ukr28.png",
    type:"match",

    left:[
        " Посткросинг – проєкт, створений <b>для обміну</b> листівками між представниками різних країн.",
        " Незнайомці <b>однаковим чином</b> надсилають одне одному поштові картки з різними зображеннями.",
        " <b>Після реєстрації</b> на спеціальному сайті вони отримують п’ять адрес із різних куточків світу.",
        " <b>Завдяки популярності посткросингу</b> на ринку України з’явилися надзвичайно цікаві витвори сучасних ілюстраторів."
    ],

    right:[
        "Листівки надсилають людям з різних континентів, <b>щоб донести звістку про себе, рідні місця, своє захоплення</b>.",
        "Найціннішими є тексти на звороті листівок, <b>адже написані вони від руки і передають частинку душі адресанта</b>.",
        "Часто відправники намагаються зробити так, <b>щоб їхня листівка була особливою</b>, наприклад, виготовляють її власноруч.",
        "<b>Якщо під час реєстрації</b> ви написали про свої вподобання, то участь у посткросингу стає ще цікавішою.",
        "<b>Коли проєкт набрав обертів</b>, учасники почали обмінюватися ще й марками, світлинами, влаштовувати конкурси, лотереї."
    ],

    correct:{
    1:0,
    2:2,
    3:3,
    4:4
    },

    points:4
    },

    { id:129, sub:"Українська мова",
    q:"Доберіть приклад (А – Д) до кожного типу складного речення (1–4).",
    type:"match",

    left:[
        " складносурядне",
        " складнопідрядне",
        " безсполучникове",
        " з різними видами зв’язку"
    ],

    right:[
        "Деякі мешканці савани, а саме: антилопи, зебри – утворюють табуни та своєю чисельністю відлякують хижаків.",
        "Газель схожа на оленя, але вона граційніша та має характерні роги, вигнуті у формі ліри.",
        "Жирафа – найвища тварина на планеті: її зріст сягає п’яти метрів заввишки.",
        "Хоча носороги мають слабкий зір, проте цю їхню ваду компенсують добре розвинуті інші зовнішні чуття (слух та нюх).",
        "Людиноподібні мавпи мають високий рівень інтелекту, у них розвинені певні мовні навички, а шимпанзе – один з найрозумніших приматів."
    ],

    correct:{
        1:1,
        2:3,
        3:2,
        4:4
    },

    points:4
    },

    { id:130, sub:"Українська мова",
    q:"Доберіть приклад (А – Д) до кожного типу відокремленого члена речення (1–4).",
    type:"match",

    left:[
        " додаток",
        " обставина",
        " означення",
        " прикладка (різновид означення)"
    ],

    right:[
        "Заварюємо зелений чай, проціджуємо його в невелику посудину, накриваємо та ставимо на вогонь.",
        "У чай додаємо спеції, зокрема кардамон, тертий імбир, гвоздику, і тримаємо на слабкому вогні хвилин дванадцять.",
        "Наприкінці додаємо для аромату лимонний чи апельсиновий сік, вичавлений незадовго до вживання.",
        "Далі чай знімаємо з вогню й удруге проціджуємо, даючи напоєві трохи охолонути.",
        "Чай краще пити гарячим, хоч і холодним він не втратить свого шарму – легкого східного смаку."
    ],

    correct:{
        1:1,
        2:3,
        3:2,
        4:4
    },

    points:4
    }

];

/* 🔹 ІСТОРІЯ */
const history = [

    { id:201, sub:"Історія",
    q:"Розгляньте зображення сучасної пам’ятної монети України, присвяченої античному місту-державі Північного Причорномор’я.<br><br>Якою цифрою на картосхемі позначено місце розташування цього поселення?",
    img:"images/history1.png",
    a:[
        "1",
        "2",
        "3",
        "4"
    ],
    correct:1,
    points:1
    },

    { id:202, sub:"Історія",
    q:"Яке удільне князівство повністю політично залежало від Київського князівства в період політичної роздробленості у XII–XIII ст.?",
    a:[
        "Чернігівське",
        "Переяславське",
        "Галицьке",
        "Волинське"
    ],
    correct:1,
    points:1
    },

    {id:203,sub:"Історія",
    q:"В уривку з історичного джерела «Рада також має запобігти сваркам у місті, боронити від кривд сиріт і вдів... кожен раз, коли виникатиме потреба... радитись про добробут громади... і злочини і шкоди, заподіяні й розсуджувати всілякі спори... пильнувати обману у мірах і вагах під час продажу товару...» ідеться про повноваження",
    a:[
        "магістрату.",
        "народного віча.",
        "січового товариства.",
        "шляхетського сеймику."
    ],
    correct:0,
    points:1
    },

    {id:204, sub:"Історія",
    q:"На фото зображено",
    img:"images/history2.png",
    a:[
        "Острозький замок.",
        "Генуезьку фортецю в Судаку.",
        "замок Любарта в Луцьку.",
        "Кам’янець-Подільську фортецю."
    ],
    correct:1,
    points:1
    },

    {id:205, sub:"Історія",
    q:"Хто з українських гетьманів здійснив похід, відображений на картосхемі?",
    img:"images/history3.png",
    a:[
        "П. Сагайдачний",
        "Б. Хмельницький",
        "І. Виговський",
        "І. Самойлович"
    ],
    correct:0,
    points:1
    },

    {id:206, sub:"Історія",
    q:"В уривку джерела «…гетьмана з усією родиною ув’язнено й після тортур заслано на Сибір, де… довгі роки прожив цей перший засланец з України» ідеться про",
    a:[
        "П. Орлика.",
        "П. Полуботка.",
        "І. Самойловича.",
        "Д. Многогрішного."
    ],
    correct:3,
    points:1
    },

    {id:207,sub:"Історія",
    q:"У 1734 р. царський уряд дозволив козакам заснувати Нову Січ на р. Підпільна, тому що прагнув",
    a:[
        "мати додатковий важіль впливу на Річ Посполиту.",
        "залучити козаків до придушення селянських виступів.",
        "використати козаків у новій російсько-турецькій війні.",
        "налагодити союзницькі стосунки із Кримським ханством."
    ],
    correct:2,
    points:1
    },

    {id:208, sub:"Історія",
    q:"Який сюжет твору стилістично зображений на поштовій марці?",
    img:"images/history4.png",
    a:[
        "«Москаль-чарівник»",
        "«Наталка Полтавка»",
        "«Енеїда»",
        "«Чорна рада»"
    ],
    correct:2,
    points:1
    },

    {id:209, sub:"Історія",
    q:"Хто є автором офортів, репродукції яких подано нижче?",
    img:"images/history5.png",
    a:[
        "М. Пимоненко",
        "Т. Шевченко",
        "В. Тропінін",
        "І. Рєпін"
    ],
    correct:1,
    points:1
    },

    {id:210, sub:"Історія",
    q:"Українські недільні школи в Російській імперії було закрито в",
    a:[
        "1839 р.",
        "1863 р.",
        "1876 р.",
        "1881 р."
    ],
    correct:1,
    points:1
    },

    {id:211, sub:"Історія",
    q:"Із якої галузі наприкінці XIX – на початку XX ст. розпочався процес монополізації промисловості Наддніпрянської України?",
    a:[
        "машинобудівної",
        "цукроварної",
        "вугледобувної",
        "текстильної"
    ],
    correct:1,
    points:1
    },

    {id:212, sub:"Історія",
    q:"Книгу, обкладинку якої зображено на фото, присвячено подіям",
    img:"images/history6.png",
    a:[
        "1917 р.",
        "1918 р.",
        "1920 р.",
        "1921 р."
    ],
    correct:1,
    points:1
    },

    {id:213, sub:"Історія",
    q:"В уривку з історичного джерела «Після прийняття рішення про необхідність підняття загального повстання в Україні повстанський штаб приступив до підготовчих заходів щодо його організації. Вирішено було пустити два відділи: південний – на Поділля, північний – на Волинь. Водночас мусить бути проведений комбінований виступ у Перший повстанський груп під керуванням командира І групи генерал-хорунжого Ю. Тютюнника…» ідеться про підготовку до",
    a:[
        "повстання Н. Григор’єва.",
        "радянсько-польської війни.",
        "Другого Зимового походу Армії УНР.",
        "антигетьманського повстання Директорії."
    ],
    correct:2,
    points:1
    },

    {id:214, sub:"Історія",
    q:"Позначте характерну рису тоталітарного режиму в Українській РСР у 30-х роках ХХ ст.",
    a:[
        "існування незалежних від влади профспілок, громадських організацій та інституцій",
        "співіснування державного та приватного секторів економіки, підтримання підприємницької активності громадян",
        "одержавлення економіки, її мілітаризація і бюрократизація, використання примусової праці",
        "визнання абсолютної цінності людської особистості, дотримання владою принципу «особа важливіша за державу»"
    ],
    correct:2,
    points:1
    },

    {id:215, sub:"Історія",
    q:"Проаналізувавши статистичні дані про співвідношення між формами власності та галузями промисловості України, виконайте завдання.<br><br>Таке співвідношення між формами власності й галузями промисловості характерне для періоду",
    img:"images/history7.png",
    a:[
        "УНР за часів Української Центральної Ради.",
        "Української Держави гетьмана П. Скоропадського.",
        "Української СРР за часів «воєнного комунізму».",
        "нової економічної політики в Українській СРР."
    ],
    correct:3,
    points:1
    },

    {id:216,sub:"Історія",
    q:"Яке явище радянської дійсності 1930-х рр. відображає картина П. Белова?",
    img:"images/history8.png",
    a:[
        "Нагнітання атмосфери страху, пошуку «ворогів народу».",
        "Використання дармової примусової робочої сили ув’язнених.",
        "Панування в суспільстві загальної недовіри, взаємної підозри.",
        "Трудовий героїзм робітників на новобудовах перших п’ятирічок."
    ],
    correct:1,
    points:1
    },

    {id:217, sub:"Історія",
    q:"Якій країні, союзниці Німеччини в Другій світовій війні, в управління було передано частину території України, загарбаної в 1941 р.?",
    a:[
        "Італії",
        "Угорщині",
        "Румунії",
        "Словаччині"
    ],
    correct:2,
    points:1
    },

    {id:218, sub:"Історія",
    q:"Гідротехнічну споруду, зображену на картосхемі жирною лінією, зведено в УРСР з метою",
    img:"images/history9.png",
    a:[
        "спрямування течії Дніпра в інше русло.",
        "реалізації однієї з «надпрограм М. Хрущова».",
        "поліпшення економічного стану півострова.",
        "уточнення дружби між українцями й кримськими татарами."
    ],
    correct:2,
    points:1
    },

    {id:219,sub:"Історія",
    q:"Розгляньте карикатуру.<br><br>Які терміни треба використати, характеризуючи явища на початку 1990-х в економіці України, що стали об’єктом сатири карикатуриста?",
    img:"images/history10.png",
    a:[
        "ринкові відносини, номенклатура",
        "дефіцит, гіперінфляція",
        "тіньова економіка, корупція",
        "бюрократизація, стагнація"
    ],
    correct:1,
    points:1
    },

    { id:220, sub:"Історія",
    q:"Який малюнок художника Станіслава Волкова присвячено захисту Донецького аеропорту?",
    a:[
        "<img src='images/a.20.png' class='option-img'>",
        "<img src='images/b.20.png' class='option-img'>",
        "<img src='images/v.20.png' class='option-img'>",
        "<img src='images/g.20.png' class='option-img'>"
        ],
    correct:2,
    points:1
    },

    {id:221, sub:"Історія",
    q:"До уривка документа (1–4) доберіть його назву (А – Д).",
    type:"match",

    left:[
        " «Війська реєстрового дозволяємо впровадити на двадцять тисяч, і це військо через гетьмана і старшину має бути зареєстроване у воєводстві Київському, нічого не займаючи із Брацлавського та Чернігівського»",
        " «Щоб військо... дозволяє мати його королівська милість сорок тисяч війська Запорозького... усі уряди в Київському, Брацлавському, Чернігівському воєводствах... мають віддаватися шляхті віри православної»",
        " «Україна, тобто землі у воєводствах Чернігівському, Київському і Брацлавському, стає вільною і незалежною країною і знов єднається із Королівством Польським і Великим Князівством Литовським під назвою Великого Князівства Руського»",
        " «Договорилися ми і постановили... Київ має залишатися на стороні їхньої царської величності, козаки, що живуть на Січі, і в Кодаку... мають бути... у володінні в державі... їхньої царської величності»"
    ],

    right:[
        "Зборівський договір (1649 р.)",
        "Білоцерківський договір (1651 р.)",
        "Гадяцький договір (1658 р.)",
        "Бахчисарайський договір (1681 р.)",
        "«Вічний мир» (1686 р.)"
    ],

    correct:{
    1:1,
    2:0,
    3:2,
    4:4
    },

    points:4
    },

    {id:222,sub:"Історія",
    q:"Установіть відповідність між виданням та його характеристикою.",
    type:"match",

    left:[
        " «Історія русів»",
        " «Основа»",
        " «Громада»",
        " «Самостійна Україна»"
    ],

    right:[
        "перший український суспільно-політичний і літературно-мистецький журнал, що видавався українською петербурзькою громадою в 1861–1862 рр.",
        "український громадсько-політичний науково-літературний збірник, що видавався в Женеві М. Драгомановим у 1878–1879 рр. та в 1882 р.",
        "одна з найвизначніших пам’яток української історичної та суспільно-політичної думки другої половини XVIII – початку XIX ст., у якій обстоювалася ідея самостійного державного розвитку України",
        "публіцистичний твір, написаний у 1900 р. М. Міхновським як програма Революційної української партії",
        "щомісячний історико-етнографічний та літературний часопис, що видавався в Києві російською та українською мовами протягом 1882–1906 рр."
    ],

    correct:{
    1:2,
    2:0,
    3:1,
    4:3
    },

    points:4
    },

    {id:223,sub:"Історія",
    q:"Поєднайте ім’я діяча (1–4) з фактами (А – Д) його біографії.",
    type:"match",

    left:[
        " К. Трильовський",
        " К. Левицький",
        " Д. Донцов",
        " Є. Коновалець"
    ],

    right:[
        "співзасновник Української національно-демократичної партії, голова Державного секретаріату ЗУНР",
        "учасник боїв за гору Маківка, командир Галицько-Буковинського куреня січових стрільців",
        "голова Союзу визволення України, теоретик та ідеолог українського націоналізму",
        "співзасновник і голова Української національної партії на Буковині, голова української національної громади в Румунії",
        "громадсько-політичний діяч Галичини, засновник патріотичної молодіжної організації «Січ»"
    ],

    correct:{
    1:4,
    2:0,
    3:2,
    4:1
    },

    points:4
    },

    {id:224, sub:"Історія",
    q:"Увідповідніть подію, описану в уривку джерела, і рік, коли вона відбулася.",
    type:"match",

    left:[
        " «Волею українського народу Організація українських націоналістів під проводом Степана Бандери проголошує відновлення Української держави…»",
        " «Уряд Української РСР вирішив звернутися до Конференції Об’єднаних Націй із заявою… про бажання приєднатися… у Сан-Франциско…»",
        " «Волею всього багатонаціонального радянського народу… Червона армія звільнила народи Західної України від влади польських поміщиків…»",
        " «Під безперервним вогнем артилерії… війська змушені були проводити переправу через Дніпро…»"
    ],

    right:[
        "1939 р.",
        "1941 р.",
        "1943 р.",
        "1944 р.",
        "1945 р."
    ],

    correct:{
    1:1,
    2:4,
    3:0,
    4:2
    },

    points:4
    },

    {id:225,sub:"Історія",
    q:"Установіть послідовність подій першої половини XVII ст.",
    type:"match",
    lettered:true,
    reverseTable:true,
    left:[
        " «…Полки ляхів зайняли Київське воєводство.., почали велику шкоду чинити людям. Козаки цього не стерпіли, повстали, ляхів порубали; із цієї причини коронний гетьман Конецьпольський вирушив на козаків… Козаки обрали собі гетьманом Тараса [Трясила] і під Переяславом вступили в битву з ляхами…»",
        " «Хто затримає народ, коли в нього так закрутилися колеса свавілля, що їх ніяким чином не можна стримати!.. Переконався я про це під Кумейками: зимою знищив Павлюка, на весну, незважаючи на такий великий розгром, ожив і піднявся супроти нас Острянин...»",
        " «Тієї ж ночі козацьке військо потай покинуло табір біля Крилова й рушило на схід… зупинилося коло наступного – Курукового озера...»",
        " «…підступно й таємно [Cулима] прокравшись… з козака-ми… насмілився напасти на фортецю, яку його милість король Владислав звелів на кошти Речі Посполитої збудувати на першому дніпровському порозі й оточити валами проти розбещеної сваволі козаків…»"
    ],

    right:["","","",""],

    correct:{
    1:2,
    2:0,
    3:3,
    4:1
    },
    points:4

    },

    { id:226, sub:"Історія",
    q:"Упорядкуйте за хронологією події Української революції 1917–1921 рр., про які йдеться в цитатах.",
    type:"match",
    lettered:true,
    reverseTable:true,

    left:[
        "«Хай буде Україна вільною… хай народ український… має право сам порядкувати своїм життям»",
        "«Молоді студенти і курсанти вирушили в похід під Крути…»",
        "«Однині воєдино зливаються століттями одірвані одна від одної частини єдиної України…»",
        "«Цією грамотою оголошую себе Гетьманом усієї України… Центральна і Мала Рада… розпускаються»"
    ],

    right:["","","",""],

    correct:{
    0:0, // А → 1
    1:1, // Б → 2
    2:3, // В → 4
    3:2  // Г → 3
    },

    points:4
    },

    {id:227, sub:"Історія",
    q:"Установіть послідовність ухвалення документів, уривки з яких процитовано.",
    type:"match",
    lettered:true,
    reverseTable:true,

    left:[
        "«Підтверджуючи відданість України… приєднатися до Статуту Ради Європи…»",
        "«На виконання закону України «Про військово-цивільні адміністрації»… утворити…»",
        "«Верховна Рада України постановляє: ввести в дію Закон України «Про Збройні Сили України»…»",
        "«Верховна Рада України постановляє: прийняти Конституцію України…»"
    ],

    right:["","","",""],

    correct:{
    0:2, // А → 3
    1:0, // Б → 1
    2:3, // В → 4
    3:1  // Г → 2
    },

    points:4
    },

    {id:228, sub:"Історія",
    q:"Які уривки з праці Наталі Яковенко «Нарис історії середньовічної та ранньомодерної України» стосуються К. Розумовського?",
    type:"multiinput",

    items:[
    "«27 червня 1672 р. гетьманом став генеральний писар… син священника…»",
    "«Був заочно «обраний» на гетьманство, а імператриця… присвоїла йому чин генерал-фельдмаршала…»",
    "«Вирішує перенести свою резиденцію до старої… столиці – Батурина»",
    "«Залишивши близько 3 тис. людей для оборони Батурина…»",
    "«Реформування судочинства… було спрямоване на реанімацію того укладу…»",
    "«Було проведене Генеральне слідство про маєтності…»",
    "«Життя гетьмана-емігранта… переконати володарів європейських держав…»"
    ],

    correct:["2","3","5"],

    points:3
    },

    {id:229,sub:"Історія",
    q:"Завдання має сім варіантів відповідей, серед яких лише три правильні. Виберіть три цифри, що позначають правильні, на Вашу думку, відповіді.<br><br>Укажіть положення Тимчасового основного закону про державну самостійність українських земель колишньої австро-угорської монархії.",

    type:"multiinput",

    items:[
        "«Ця державна територія творить самостійну Західноукраїнську Народну Республіку…»",
        "«Всенародні збори затверджують трактати політичні й економічні…»",
        "«Народна Українська Держава має бути вичищена від насадних з Петрограду найманців…»",
        "«Гербом… є: золотий лев на синім полі… Державний прапор є синьо-жовтий…»",
        "«До часу зібрання Установчих Зборів виконує всю владу Українська Національна Рада й Державний секретаріат…»",
        "«Отож, насамперед приписуємо… Раді народних міністрів… вести розпочаті переговори про мир…»",
        "«Привітовши… Директорія Української Народної Республіки ухвалила ту злуку прийняти…»"
    ],

    correct:["1","4","5"],

    points:3
    },

    {id:230,sub:"Історія",
    q:"Позначте віхи суспільно-політичного життя в Україні, що відбулися впродовж 2014–2019 рр.",

    type:"multiinput",

    items:[
        "створення Збройних Сил України",
        "запровадження безвізового режиму між Україною та Європейським Союзом",
        "підписання Будапештського меморандуму",
        "вступ до Світової організації торгівлі (СОТ)",
        "набрання чинності Угоди про асоціацію між Україною та Європейським Союзом",
        "запровадження національної грошової одиниці – гривні",
        "надання Томосу на автокефалію Православній Церкві України"
    ],

    correct:["2","5","7"],

    points:3
    }
];

/* 🔹 АНГЛІЙСЬКА */
const eng = [

    {id:301, sub:"Англійська мова",

        q:"Read the text below. Match choices (A–H) to (1–5). There are three choices you do not need to use.<br><br><b>Chinese Horoscopes</b><br><br>According to the Chinese calendar, the year you were born may determine your personality. Every year is represented by an animal, and legend has it that people born under that animal have certain personality traits. <br><br> What personality traits correspond to what animal?",

        img:"images/eng1.png",

        a:[
            "Calm and shy",
            "Generous and sensitive",
            "Reliable and fair",
            "Thoughtful and intuitive",
            "Wise and sociable",
            "Bossy and reserved",
            "Active and daring",
            "Popular and fun-loving"
        ],

        correct:4,
        points:1
    },

    {id:302, sub:"Англійська мова",

        q:"Read the text below. Match choices (A–H) to (1–5). There are three choices you do not need to use.<br><br><b>Chinese Horoscopes</b><br><br>According to the Chinese calendar, the year you were born may determine your personality. Every year is represented by an animal, and legend has it that people born under that animal have certain personality traits. <br><br> What personality traits correspond to what animal?",

        img:"images/eng2.png",

        a:[
            "Calm and shy",
            "Generous and sensitive",
            "Reliable and fair",
            "Thoughtful and intuitive",
            "Wise and sociable",
            "Bossy and reserved",
            "Active and daring",
            "Popular and fun-loving"
        ],

        correct:3,
        points:1
    },
    
    {id:303, sub:"Англійська мова",

        q:"Read the text below. Match choices (A–H) to (1–5). There are three choices you do not need to use.<br><br><b>Chinese Horoscopes</b><br><br>According to the Chinese calendar, the year you were born may determine your personality. Every year is represented by an animal, and legend has it that people born under that animal have certain personality traits. <br><br> What personality traits correspond to what animal?",

        img:"images/eng3.png",

        a:[
            "Calm and shy",
            "Generous and sensitive",
            "Reliable and fair",
            "Thoughtful and intuitive",
            "Wise and sociable",
            "Bossy and reserved",
            "Active and daring",
            "Popular and fun-loving"
        ],

        correct:6,
        points:1
    },
    
    {id:304, sub:"Англійська мова",

        q:"Read the text below. Match choices (A–H) to (1–5). There are three choices you do not need to use.<br><br><b>Chinese Horoscopes</b><br><br>According to the Chinese calendar, the year you were born may determine your personality. Every year is represented by an animal, and legend has it that people born under that animal have certain personality traits. <br><br> What personality traits correspond to what animal?",

        img:"images/eng4.png",

        a:[
            "Calm and shy",
            "Generous and sensitive",
            "Reliable and fair",
            "Thoughtful and intuitive",
            "Wise and sociable",
            "Bossy and reserved",
            "Active and daring",
            "Popular and fun-loving"
        ],

        correct:7,
        points:1
    },
    
    {id:305, sub:"Англійська мова",

        q:"Read the text below. Match choices (A–H) to (1–5). There are three choices you do not need to use.<br><br><b>Chinese Horoscopes</b><br><br>According to the Chinese calendar, the year you were born may determine your personality. Every year is represented by an animal, and legend has it that people born under that animal have certain personality traits. <br><br> What personality traits correspond to what animal?",

        img:"images/eng5.png",

        a:[
            "Calm and shy",
            "Generous and sensitive",
            "Reliable and fair",
            "Thoughtful and intuitive",
            "Wise and sociable",
            "Bossy and reserved",
            "Active and daring",
            "Popular and fun-loving"
        ],

        correct:2,
        points:1
    },

    {id:306, sub:"Англійська мова",

    q:"Read the text below. For questions (6–10) choose the correct answer (A, B, C or D).<br><br><b>The History of Chupa Chups Lollipops</b><br><br>The Chupa Chups company started as an idea of a Spanish citizen named Enric Bernat in 1958. Mr. Bernat started his career at an apple jam factory. He approached investors about a lollipop business but he failed to get support. He took over the company himself and built the first production machines with his own hands. He also decided that the new creation would be called Chupa Chups, after the Spanish verb chupar, which translates into to suck.<br><br>Enric Bernat knew that the bon-bons on a wooden stick would be an instant hit. Previously candy had been marketed as a luxury and kept away from children. However, he knew that if he could get the candy into the view of children he would sell many more lollipops. Five years after he first introduced the idea, Chupa Chups were being sold at over 300,000 stores across Europe.<br><br>The original Chupa Chups sales force was over 600 sales agents for 300,000 locations.<br><br>This amazing sales force sped across Europe to bring the good news and delicious taste of the Chupa Chups lollipops to the masses. Without their dedication and excitement, there would be no way the company could have grown to the massive size that it is today.<br><br>Sadly, the traditional wooden stick that was associated with Chupa Chups had to be discontinued and replaced with a plastic one due to the lack of wood available in Spain. The stick has remained plastic ever since. Chupa Chups were originally going to be called GOL but the name did not stick.<br><br>An advertising firm came up with the idea to name them Chupa and the delightful lollipops were born. Salvador Dali, the famous painter, created the new Chupa Chups logo, which remains on the wrapper on all of the lollipops to this day.<br><br>The Chupa Chups business went international beginning with Asia and Australia in the 1970's. It soon followed to North America and the rest of Europe. The amazing results led to a high point for the company, with the production of over 4 billion Chupa Chups lollipops during the 2003 calendar year.<br><br>Which of the following is stated in the text about Enric Bernat?",

    a:[
        "He inherited the family business.",
        "He borrowed money from a bank.",
        "He devoted his life to jam production.",
        "He made the factory equipment himself."
    ],

    correct:3,
    points:1
    },
    
    {id:307, sub:"Англійська мова",

    q:"Read the text below. For questions (6–10) choose the correct answer (A, B, C or D).<br><br><b>The History of Chupa Chups Lollipops</b><br><br>The Chupa Chups company started as an idea of a Spanish citizen named Enric Bernat in 1958. Mr. Bernat started his career at an apple jam factory. He approached investors about a lollipop business but he failed to get support. He took over the company himself and built the first production machines with his own hands. He also decided that the new creation would be called Chupa Chups, after the Spanish verb chupar, which translates into to suck.<br><br>Enric Bernat knew that the bon-bons on a wooden stick would be an instant hit. Previously candy had been marketed as a luxury and kept away from children. However, he knew that if he could get the candy into the view of children he would sell many more lollipops. Five years after he first introduced the idea, Chupa Chups were being sold at over 300,000 stores across Europe.<br><br>The original Chupa Chups sales force was over 600 sales agents for 300,000 locations.<br><br>This amazing sales force sped across Europe to bring the good news and delicious taste of the Chupa Chups lollipops to the masses. Without their dedication and excitement, there would be no way the company could have grown to the massive size that it is today.<br><br>Sadly, the traditional wooden stick that was associated with Chupa Chups had to be discontinued and replaced with a plastic one due to the lack of wood available in Spain. The stick has remained plastic ever since. Chupa Chups were originally going to be called GOL but the name did not stick.<br><br>An advertising firm came up with the idea to name them Chupa and the delightful lollipops were born. Salvador Dali, the famous painter, created the new Chupa Chups logo, which remains on the wrapper on all of the lollipops to this day.<br><br>The Chupa Chups business went international beginning with Asia and Australia in the 1970's. It soon followed to North America and the rest of Europe. The amazing results led to a high point for the company, with the production of over 4 billion Chupa Chups lollipops during the 2003 calendar year.<br><br>What is TRUE about the Chupa Chups logo?",

    a:[
        "It was designed by a great artist.",
        "It made the lollipop more popular.",
        "It has changed three times by now.",
        "It varies from country to country."
    ],

    correct:0,
    points:1
    },

    {id:308, sub:"Англійська мова",

    q:"Read the text below. For questions (6–10) choose the correct answer (A, B, C or D).<br><br><b>The History of Chupa Chups Lollipops</b><br><br>The Chupa Chups company started as an idea of a Spanish citizen named Enric Bernat in 1958. Mr. Bernat started his career at an apple jam factory. He approached investors about a lollipop business but he failed to get support. He took over the company himself and built the first production machines with his own hands. He also decided that the new creation would be called Chupa Chups, after the Spanish verb chupar, which translates into to suck.<br><br>Enric Bernat knew that the bon-bons on a wooden stick would be an instant hit. Previously candy had been marketed as a luxury and kept away from children. However, he knew that if he could get the candy into the view of children he would sell many more lollipops. Five years after he first introduced the idea, Chupa Chups were being sold at over 300,000 stores across Europe.<br><br>The original Chupa Chups sales force was over 600 sales agents for 300,000 locations.<br><br>This amazing sales force sped across Europe to bring the good news and delicious taste of the Chupa Chups lollipops to the masses. Without their dedication and excitement, there would be no way the company could have grown to the massive size that it is today.<br><br>Sadly, the traditional wooden stick that was associated with Chupa Chups had to be discontinued and replaced with a plastic one due to the lack of wood available in Spain. The stick has remained plastic ever since. Chupa Chups were originally going to be called GOL but the name did not stick.<br><br>An advertising firm came up with the idea to name them Chupa and the delightful lollipops were born. Salvador Dali, the famous painter, created the new Chupa Chups logo, which remains on the wrapper on all of the lollipops to this day.<br><br>The Chupa Chups business went international beginning with Asia and Australia in the 1970's. It soon followed to North America and the rest of Europe. The amazing results led to a high point for the company, with the production of over 4 billion Chupa Chups lollipops during the 2003 calendar year.<br><br>Where was the Chupa Chups business originally concentrated?",

    a:[
        "In Asia",
        "In Europe",
        "In Australia",
        "In America"
    ],

    correct:1,
    points:1
    },

    {id:309, sub:"Англійська мова",

    q:"Read the text below. For questions (6–10) choose the correct answer (A, B, C or D).<br><br><b>The History of Chupa Chups Lollipops</b><br><br>The Chupa Chups company started as an idea of a Spanish citizen named Enric Bernat in 1958. Mr. Bernat started his career at an apple jam factory. He approached investors about a lollipop business but he failed to get support. He took over the company himself and built the first production machines with his own hands. He also decided that the new creation would be called Chupa Chups, after the Spanish verb chupar, which translates into to suck.<br><br>Enric Bernat knew that the bon-bons on a wooden stick would be an instant hit. Previously candy had been marketed as a luxury and kept away from children. However, he knew that if he could get the candy into the view of children he would sell many more lollipops. Five years after he first introduced the idea, Chupa Chups were being sold at over 300,000 stores across Europe.<br><br>The original Chupa Chups sales force was over 600 sales agents for 300,000 locations.<br><br>This amazing sales force sped across Europe to bring the good news and delicious taste of the Chupa Chups lollipops to the masses. Without their dedication and excitement, there would be no way the company could have grown to the massive size that it is today.<br><br>Sadly, the traditional wooden stick that was associated with Chupa Chups had to be discontinued and replaced with a plastic one due to the lack of wood available in Spain. The stick has remained plastic ever since. Chupa Chups were originally going to be called GOL but the name did not stick.<br><br>An advertising firm came up with the idea to name them Chupa and the delightful lollipops were born. Salvador Dali, the famous painter, created the new Chupa Chups logo, which remains on the wrapper on all of the lollipops to this day.<br><br>The Chupa Chups business went international beginning with Asia and Australia in the 1970's. It soon followed to North America and the rest of Europe. The amazing results led to a high point for the company, with the production of over 4 billion Chupa Chups lollipops during the 2003 calendar year.<br><br>According to the text, what helped the company to become a big success?",

    a:[
        "The product’s unusual name",
        "The variety of lollipop tastes",
        "The candy’s attractive wrapping",
        "The sales staff’s enthusiasm"
    ],

    correct:3,
    points:1
    },
    
    {id:310, sub:"Англійська мова",

    q:"Read the text below. For questions (6-10) choose the correct answer (A, B, C or D).<br><br><b>The History of Chupa Chups Lollipops</b><br><br>The Chupa Chups company started as an idea of a Spanish citizen named Enric Bernat in 1958. Mr. Bernat started his career at an apple jam factory. He approached investors about a lollipop business but he failed to get support. He took over the company himself and built the first production machines with his own hands. He also decided that the new creation would be called Chupa Chups, after the Spanish verb chupar, which translates into to suck.<br><br>Enric Bernat knew that the bon-bons on a wooden stick would be an instant hit. Previously candy had been marketed as a luxury and kept away from children. However, he knew that if he could get the candy into the view of children he would sell many more lollipops. Five years after he first introduced the idea, Chupa Chups were being sold at over 300,000 stores across Europe.<br><br>The original Chupa Chups sales force was over 600 sales agents for 300,000 locations.<br><br>This amazing sales force sped across Europe to bring the good news and delicious taste of the Chupa Chups lollipops to the masses. Without their dedication and excitement, there would be no way the company could have grown to the massive size that it is today.<br><br>Sadly, the traditional wooden stick that was associated with Chupa Chups had to be discontinued and replaced with a plastic one due to the lack of wood available in Spain. The stick has remained plastic ever since. Chupa Chups were originally going to be called GOL but the name did not stick.<br><br>An advertising firm came up with the idea to name them Chupa and the delightful lollipops were born. Salvador Dali, the famous painter, created the new Chupa Chups logo, which remains on the wrapper on all of the lollipops to this day.<br><br>The Chupa Chups business went international beginning with Asia and Australia in the 1970's. It soon followed to North America and the rest of Europe. The amazing results led to a high point for the company, with the production of over 4 billion Chupa Chups lollipops during the 2003 calendar year.<br><br>Which of the following is NOT TRUE according to the text?",

    a:[
        "Candies used to be an expensive treat.",
        "The name Chupa Chups means bon-bons.",
        "Chupa Chups originally had wooden sticks.",
        "Bernat’s product was meant mainly for children."
    ],

    correct:1,
    points:1
    },

    {id:311, sub:"Англійська мова",

    q:"Read the texts below. Match choices (A-H) to (11-16). There are two choices you do not need to use. Write your answers on the separate answer sheet.<br><br><img src='images/eng11.png' class='question-img'><br><br><b>Beacon Rally Karts Ltd.</b><br><br>We have three outdoor, off-road karting tracks available. Our three tracks are complemented by four different kart sizes: kiddies (ages 5–6), children (ages 7–10), junior (ages 10–15) and adult (ages 15+). You’ll need all your concentration, skill and power to keep the kart on the very best line.<br><br>Prices start from £9.00, please see the website www.beaconrallykarts.co.uk or call 01394 610066.<br><br>Discount for groups of 2 or more drivers.<br><br>Which of the advertised attractions",

    a:[
        "is interesting for music lovers",
        "recommends making a reservation",
        "gives you a chance to buy souvenirs",
        "invites you to go whitewater rafting",
        "charges no fee the following day",
        "is for those who like horse riding",
        "can be visited every day in the daylight",
        "is cheaper to visit if you come with friends"
    ],

    correct:7, // H
    points:1
    },

    {id:312, sub:"Англійська мова",

    q:"Read the texts below. Match choices (A-H) to (11-16). There are two choices you do not need to use. Write your answers on the separate answer sheet. <img src='images/eng12.png' class='question-img'><br><br><b>RSPB Minsmere Nature Reserve</b><br><br>There are several miles of countryside walks through Suffolk’s gorgeous coastal and wetland scenery, bringing you close to a wide variety of wildlife. Families and youth groups can explore the Wild Zone and Wild Wood Adventure, discovering more about how some of Minsmere’s special wildlife lives whilst having fun.<br><br>Adult £7.50, Child (4-18) £3, RSPB members & RSPB Wildlife Explorers FREE. Nature trails and hikes open daily dawn–dusk.<br><br>Which of the advertised attractions",

    a:[
        "is interesting for music lovers",
        "recommends making a reservation",
        "gives you a chance to buy souvenirs",
        "invites you to go whitewater rafting",
        "charges no fee the following day",
        "is for those who like horse riding",
        "can be visited every day in the daylight",
        "is cheaper to visit if you come with friends"
    ],

    correct:6,
    points:1
    },

    { id:313, sub:"Англійська мова",

    q:"Read the texts below. Match choices (A-H) to (11-16). There are two choices you do not need to use. Write your answers on the separate answer sheet.<img src='images/eng13.png' class='question-img'><br><br><b>The Canoe Man</b><br><br>The Canoe Man is the largest canoe hire operator in Norfolk/North Suffolk. Enjoy a tranquil day’s paddling with us from Buxton Lamas on the River Bure to Wroxham (minibus pick-up from Wroxham Station to Buxton included) and receive a second day's hire free from our Wroxham Centre.<br><br>Opening Hours: 10 am–7 pm.<br><br>Which of the advertised attractions",

    a:[
        "is interesting for music lovers",
        "recommends making a reservation",
        "gives you a chance to buy souvenirs",
        "invites you to go whitewater rafting",
        "charges no fee the following day",
        "is for those who like horse riding",
        "can be visited every day in the daylight",
        "is cheaper to visit if you come with friends"
    ],

    correct:4,
    points:1
    },

    {id:314, sub:"Англійська мова",

    q:"Read the texts below. Match choices (A-H) to (11-16). There are two choices you do not need to use. Write your answers on the separate answer sheet.<img src='images/eng14.png' class='question-img'><br><br><b>Dinosaur Adventure</b><br><br>So Much To Do - Dinosaur Trail with track: T-Rex<br><br>• Neanderthal Walk<br>• Secret Animal Garden – Deer Safari (small additional charge)<br>• The Dinosculptor Lost World 'Amazing' Adventure<br>• Adventure Play Area<br>• Tiny 'Terror'saurs-under SS play area<br>• Raptor Racers<br>• Restaurants, snack shacks, free car parking, disabled facilities and a gift shop.<br><br>Which of the advertised attractions",

    a:[
        "is interesting for music lovers",
        "recommends making a reservation",
        "gives you a chance to buy souvenirs",
        "invites you to go whitewater rafting",
        "charges no fee the following day",
        "is for those who like horse riding",
        "can be visited every day in the daylight",
        "is cheaper to visit if you come with friends"
    ],

    correct:2,
    points:1
    },

    {id:315, sub:"Англійська мова",

    q:"Read the texts below. Match choices (A-H) to (11-16). There are two choices you do not need to use. Write your answers on the separate answer sheet.<img src='images/eng15.png' class='question-img'><br><br><b>Fineway Launch Hire</b><br><br>We are a family run boat hire company in Wroxham offering 3 different sized boats, including electric boats for up to 6 people and diesel boats for up to 11 people. We are open all year using the larger boats in the Winter as they have heaters. We have our own free car park and toilets.<br><br>Booking is always advisable especially during school holidays.<br><br>Which of the advertised attractions",

    a:[
        "is interesting for music lovers",
        "recommends making a reservation",
        "gives you a chance to buy souvenirs",
        "invites you to go whitewater rafting",
        "charges no fee the following day",
        "is for those who like horse riding",
        "can be visited every day in the daylight",
        "is cheaper to visit if you come with friends"
    ],

    correct:1,
    points:1
    },

    {id:316, sub:"Англійська мова",

    q:"Read the texts below. Match choices (A-H) to (11-16). There are two choices you do not need to use. Write your answers on the separate answer sheet.<img src='images/eng16.png' class='question-img'><br><br><b>Broads Tours</b><br><br>During the summer months you can choose from our ever popular Boogie Cruises to Live Jazz or even a traditional Ceilidh band. If you are looking for a unique venue for your family party you can even charter one of our passenger boats.<br><br>Please see our website for more details.<br><br>TOUR PRICES: 1 hour trip: £7.50 per adult, £6.00 per child.<br><br>Which of the advertised attractions",

    a:[
        "is interesting for music lovers",
        "recommends making a reservation",
        "gives you a chance to buy souvenirs",
        "invites you to go whitewater rafting",
        "charges no fee the following day",
        "is for those who like horse riding",
        "can be visited every day in the daylight",
        "is cheaper to visit if you come with friends"
    ],

    correct:0,
    points:1
    },


    {id:317,sub:"Англійська мова",

    q:"Read the text below. Choose from (A–H) the one which best fits each space (17–22). There are two choices you do not need to use.<br><br><b>The Boy Scout Who Was Tintin</b><br><br>As with many great fictional heroes, there are several possible models who may or may not have inspired the character of the brave boy reporter Tintin. But one of the most likely was a Danish youngster named Palle Huld, (17) ______ to travel around the world in imitation of Jules Verne’s Phileas Fogg. In his case, he was given just 46 days to accomplish the feat, wasn’t allowed a companion and was forbidden to travel by aeroplane. Nevertheless, Huld managed it in 44 days. Nor was it only his age and dauntless spirit (18) ______ . It was also his appearance. He had freckles, a snub nose and unruly bright-red hair.<br><br>Huld, (19) ______ , was chosen from applicants, and set off among a storm of publicity in March. His voyage was not without mishaps, yet he made it home - much to the relief of his poor mother, (20) ______ during her boy’s absence to help her cope with the stress.<br><br>The following year, the enterprising Huld wrote his own account of his adventures, A Boy Scout Around the World, (21) ______ . His travels around the globe apparently gave him a taste for fame, too. He went on to become a distinguished actor, (22) ______ , including Three Men In Search of a Troll. <br><br><i> But one of the most likely was a Danish youngster named Palle Huld, (17) ______ to travel around the world in imitation of Jules Verne’s Phileas Fogg. In his case, he was given just 46 days to accomplish the feat, wasn’t allowed a companion and was forbidden to travel by aeroplane.</i>",
    a:[
        "which was translated into several languages",
        "who at the age of 15 won a competition",
        "who had been prescribed sleeping pills",
        "that influenced his decision",
        "who was then working in an automobile dealership",
        "appearing in some 40 films",
        "that made him a truthful model for Tintin",
        "making his wishes come true"
    ],

    correct:1,
    points:1
    },

    {id:318,sub:"Англійська мова",

    q:"Read the text below. Choose from (A–H) the one which best fits each space (17–22). There are two choices you do not need to use.<br><br><b>The Boy Scout Who Was Tintin</b><br><br>As with many great fictional heroes, there are several possible models who may or may not have inspired the character of the brave boy reporter Tintin. But one of the most likely was a Danish youngster named Palle Huld, (17) ______ to travel around the world in imitation of Jules Verne’s Phileas Fogg. In his case, he was given just 46 days to accomplish the feat, wasn’t allowed a companion and was forbidden to travel by aeroplane. Nevertheless, Huld managed it in 44 days. Nor was it only his age and dauntless spirit (18) ______ . It was also his appearance. He had freckles, a snub nose and unruly bright-red hair.<br><br>Huld, (19) ______ , was chosen from applicants, and set off among a storm of publicity in March. His voyage was not without mishaps, yet he made it home - much to the relief of his poor mother, (20) ______ during her boy’s absence to help her cope with the stress.<br><br>The following year, the enterprising Huld wrote his own account of his adventures, A Boy Scout Around the World, (21) ______ . His travels around the globe apparently gave him a taste for fame, too. He went on to become a distinguished actor, (22) ______ , including Three Men In Search of a Troll. <br><br><i>Nevertheless, Huld managed it in 44 days. Nor was it only his age and dauntless spirit (18) ______ .</i>",
    a:[
        "which was translated into several languages",
        "who at the age of 15 won a competition",
        "who had been prescribed sleeping pills",
        "that influenced his decision",
        "who was then working in an automobile dealership",
        "appearing in some 40 films",
        "that made him a truthful model for Tintin",
        "making his wishes come true"
    ],

    correct:6,
    points:1
    },
    
    {id:319,sub:"Англійська мова",

    q:"Read the text below. Choose from (A–H) the one which best fits each space (17–22). There are two choices you do not need to use.<br><br><b>The Boy Scout Who Was Tintin</b><br><br>As with many great fictional heroes, there are several possible models who may or may not have inspired the character of the brave boy reporter Tintin. But one of the most likely was a Danish youngster named Palle Huld, (17) ______ to travel around the world in imitation of Jules Verne’s Phileas Fogg. In his case, he was given just 46 days to accomplish the feat, wasn’t allowed a companion and was forbidden to travel by aeroplane. Nevertheless, Huld managed it in 44 days. Nor was it only his age and dauntless spirit (18) ______ . It was also his appearance. He had freckles, a snub nose and unruly bright-red hair.<br><br>Huld, (19) ______ , was chosen from applicants, and set off among a storm of publicity in March. His voyage was not without mishaps, yet he made it home - much to the relief of his poor mother, (20) ______ during her boy’s absence to help her cope with the stress.<br><br>The following year, the enterprising Huld wrote his own account of his adventures, A Boy Scout Around the World, (21) ______ . His travels around the globe apparently gave him a taste for fame, too. He went on to become a distinguished actor, (22) ______ , including Three Men In Search of a Troll. <br><br><i>Huld, (19) ______ , was chosen from applicants, and set off among a storm of publicity in March.</i>",
    a:[
        "which was translated into several languages",
        "who at the age of 15 won a competition",
        "who had been prescribed sleeping pills",
        "that influenced his decision",
        "who was then working in an automobile dealership",
        "appearing in some 40 films",
        "that made him a truthful model for Tintin",
        "making his wishes come true"
    ],

    correct:4,
    points:1
    },

    {id:320,sub:"Англійська мова",

    q:"Read the text below. Choose from (A–H) the one which best fits each space (17–22). There are two choices you do not need to use.<br><br><b>The Boy Scout Who Was Tintin</b><br><br>As with many great fictional heroes, there are several possible models who may or may not have inspired the character of the brave boy reporter Tintin. But one of the most likely was a Danish youngster named Palle Huld, (17) ______ to travel around the world in imitation of Jules Verne’s Phileas Fogg. In his case, he was given just 46 days to accomplish the feat, wasn’t allowed a companion and was forbidden to travel by aeroplane. Nevertheless, Huld managed it in 44 days. Nor was it only his age and dauntless spirit (18) ______ . It was also his appearance. He had freckles, a snub nose and unruly bright-red hair.<br><br>Huld, (19) ______ , was chosen from applicants, and set off among a storm of publicity in March. His voyage was not without mishaps, yet he made it home - much to the relief of his poor mother, (20) ______ during her boy’s absence to help her cope with the stress.<br><br>The following year, the enterprising Huld wrote his own account of his adventures, A Boy Scout Around the World, (21) ______ . His travels around the globe apparently gave him a taste for fame, too. He went on to become a distinguished actor, (22) ______ , including Three Men In Search of a Troll. <br><br><i>His voyage was not without mishaps, yet he made it home - much to the relief of his poor mother, (20) ______ during her boy’s absence to help her cope with the stress.</i>",
    a:[
        "which was translated into several languages",
        "who at the age of 15 won a competition",
        "who had been prescribed sleeping pills",
        "that influenced his decision",
        "who was then working in an automobile dealership",
        "appearing in some 40 films",
        "that made him a truthful model for Tintin",
        "making his wishes come true"
    ],

    correct:2,
    points:1
    },

    {id:321,sub:"Англійська мова",

    q:"Read the text below. Choose from (A–H) the one which best fits each space (17–22). There are two choices you do not need to use.<br><br><b>The Boy Scout Who Was Tintin</b><br><br>As with many great fictional heroes, there are several possible models who may or may not have inspired the character of the brave boy reporter Tintin. But one of the most likely was a Danish youngster named Palle Huld, (17) ______ to travel around the world in imitation of Jules Verne’s Phileas Fogg. In his case, he was given just 46 days to accomplish the feat, wasn’t allowed a companion and was forbidden to travel by aeroplane. Nevertheless, Huld managed it in 44 days. Nor was it only his age and dauntless spirit (18) ______ . It was also his appearance. He had freckles, a snub nose and unruly bright-red hair.<br><br>Huld, (19) ______ , was chosen from applicants, and set off among a storm of publicity in March. His voyage was not without mishaps, yet he made it home - much to the relief of his poor mother, (20) ______ during her boy’s absence to help her cope with the stress.<br><br>The following year, the enterprising Huld wrote his own account of his adventures, A Boy Scout Around the World, (21) ______ . His travels around the globe apparently gave him a taste for fame, too. He went on to become a distinguished actor, (22) ______ , including Three Men In Search of a Troll. <br><br><i>The following year, the enterprising Huld wrote his own account of his adventures, A Boy Seoul Around the World, (21) ______ .</i>",
    a:[
        "which was translated into several languages",
        "who at the age of 15 won a competition",
        "who had been prescribed sleeping pills",
        "that influenced his decision",
        "who was then working in an automobile dealership",
        "appearing in some 40 films",
        "that made him a truthful model for Tintin",
        "making his wishes come true"
    ],

    correct:0,
    points:1
    },

    {id:322,sub:"Англійська мова",

    q:"Read the text below. Choose from (A–H) the one which best fits each space (17–22). There are two choices you do not need to use.<br><br><b>The Boy Scout Who Was Tintin</b><br><br>As with many great fictional heroes, there are several possible models who may or may not have inspired the character of the brave boy reporter Tintin. But one of the most likely was a Danish youngster named Palle Huld, (17) ______ to travel around the world in imitation of Jules Verne’s Phileas Fogg. In his case, he was given just 46 days to accomplish the feat, wasn’t allowed a companion and was forbidden to travel by aeroplane. Nevertheless, Huld managed it in 44 days. Nor was it only his age and dauntless spirit (18) ______ . It was also his appearance. He had freckles, a snub nose and unruly bright-red hair.<br><br>Huld, (19) ______ , was chosen from applicants, and set off among a storm of publicity in March. His voyage was not without mishaps, yet he made it home - much to the relief of his poor mother, (20) ______ during her boy’s absence to help her cope with the stress.<br><br>The following year, the enterprising Huld wrote his own account of his adventures, A Boy Scout Around the World, (21) ______ . His travels around the globe apparently gave him a taste for fame, too. He went on to become a distinguished actor, (22) ______ , including Three Men In Search of a Troll. <br><br><i>He went on to become a distinguished actor, (22) ______ , including Three Men In Search of a Troll.</i>",
    a:[
        "which was translated into several languages",
        "who at the age of 15 won a competition",
        "who had been prescribed sleeping pills",
        "that influenced his decision",
        "who was then working in an automobile dealership",
        "appearing in some 40 films",
        "that made him a truthful model for Tintin",
        "making his wishes come true"
    ],

    correct:5,
    points:1
    },

    {id:323, sub:"Англійська мова",

    q:"<b>Bach, Beatles and ...Maths?</b><br><br>From the rich complexity of the Bach fugues to the catchy songs of the Beatles music and mathematics overlap in all kinds of interesting ______. Would you believe that research has shown that certain __________ of music end up being more popular and mainstream __________ their mathematical structure? The link between the physical practice of music and strong mathematical __________ are demonstrated in various studies. They show that kids who play a musical instrument can __________ more complex arithmetical operations than those who do not play an instrument.<br><br><i>From the rich complexity of the Bach fugues to the catchy songs of the Beatles music and mathematics overlap in all kinds of interesting __________.</i>",

    a:[
        "means",
        "items",
        "ways",
        "methods"
    ],

    correct:2,
    points:1
    },

    {id:324, sub:"Англійська мова",

    q:"<b>Bach, Beatles and ...Maths?</b><br><br>From the rich complexity of the Bach fugues to the catchy songs of the Beatles music and mathematics overlap in all kinds of interesting ______. Would you believe that research has shown that certain __________ of music end up being more popular and mainstream __________ their mathematical structure? The link between the physical practice of music and strong mathematical __________ are demonstrated in various studies. They show that kids who play a musical instrument can __________ more complex arithmetical operations than those who do not play an instrument.<br><br><i>Would you believe that research has shown that certain (24) __________ of music end up being more popular and mainstream __________ their mathematical structure?</i>",

    a:[
        "means",
        "items",
        "ways",
        "methods"
    ],

    correct:1,
    points:1
    },

    {id:325, sub:"Англійська мова",

    q:"<b>Bach, Beatles and ...Maths?</b><br><br>From the rich complexity of the Bach fugues to the catchy songs of the Beatles music and mathematics overlap in all kinds of interesting ______. Would you believe that research has shown that certain __________ of music end up being more popular and mainstream __________ their mathematical structure? The link between the physical practice of music and strong mathematical __________ are demonstrated in various studies. They show that kids who play a musical instrument can __________ more complex arithmetical operations than those who do not play an instrument.<br><br><i>Would you believe that research has shown that certain __________ of music end up being more popular and mainstream (25) __________ their mathematical structure?</i>",

    a:[
        "means",
        "items",
        "ways",
        "methods"
    ],

    correct:2,
    points:1
    },

    {id:326, sub:"Англійська мова",

    q:"<b>Bach, Beatles and ...Maths?</b><br><br>From the rich complexity of the Bach fugues to the catchy songs of the Beatles music and mathematics overlap in all kinds of interesting ______. Would you believe that research has shown that certain __________ of music end up being more popular and mainstream __________ their mathematical structure? The link between the physical practice of music and strong mathematical __________ are demonstrated in various studies. They show that kids who play a musical instrument can __________ more complex arithmetical operations than those who do not play an instrument.<br><br><i>The link between the physical practice of music and strong mathematical __________ are demonstrated in various studies. </i>",

    a:[
        "means",
        "items",
        "ways",
        "methods"
    ],

    correct:0,
    points:1
    },

    {id:327, sub:"Англійська мова",

    q:"<b>Bach, Beatles and ...Maths?</b><br><br>From the rich complexity of the Bach fugues to the catchy songs of the Beatles music and mathematics overlap in all kinds of interesting ______. Would you believe that research has shown that certain __________ of music end up being more popular and mainstream __________ their mathematical structure? The link between the physical practice of music and strong mathematical __________ are demonstrated in various studies. They show that kids who play a musical instrument can __________ more complex arithmetical operations than those who do not play an instrument.<br><br><i>They show that kids who play a musical instrument can __________ more complex arithmetical operations than those who do not play an instrument.</i>",

    a:[
        "means",
        "items",
        "ways",
        "methods"
    ],

    correct:3,
    points:1
    },

    {id:328,sub:"Англійська мова",

    q:"<b>Skype Logo</b><br><br><b>In 2003 ______ form </b> of the popular Skype icon ______.It was based on a simple yellow speech balloon. The icon ________ several overhauls throughout the years. The current Skype icon features the letter “S” in white color with a bright blue background. The bubbly Skype logo is based on the Arial Rounded MT Bold typeface. It features the company name on a series of circles which ________ make a “cloud”. The blue color in the Skype logo represents communication, prosperity and ________ of hope; whereas the white color represents peace and harmony.",

    a:[
        "earlier",
        "the earliest",
        "earliest",
        "the earlier"
    ],

    correct:1,
    points:1
    },

    {id:329,sub:"Англійська мова",

    q:"<b>Skype Logo</b><br><br>In 2003 ______ form of <b> the popular Skype icon ______.</b>It was based on a simple yellow speech balloon. The icon ________ several overhauls throughout the years. The current Skype icon features the letter “S” in white color with a bright blue background. The bubbly Skype logo is based on the Arial Rounded MT Bold typeface. It features the company name on a series of circles which ________ make a “cloud”. The blue color in the Skype logo represents communication, prosperity and ________ of hope; whereas the white color represents peace and harmony.",

    a:[
        "was launched",
        "has been launched",
        "had been launched",
        "is launched"
    ],

    correct:0,
    points:1
    },

    {id:330,sub:"Англійська мова",

    q:"<b>Skype Logo</b><br><br>In 2003 ______ form of the popular Skype icon ______.It was based on a simple yellow speech balloon. <b> The icon ________ several overhauls throughout the years. </b> The current Skype icon features the letter “S” in white color with a bright blue background. The bubbly Skype logo is based on the Arial Rounded MT Bold typeface. It features the company name on a series of circles which ________ make a “cloud”. The blue color in the Skype logo represents communication, prosperity and ________ of hope; whereas the white color represents peace and harmony.",

    a:[
        "undergo",
        "undergone",
        "undergoing",
        "underwent"
    ],

    correct:3,
    points:1
    },

    {id:331,sub:"Англійська мова",

    q:"<b>Skype Logo</b><br><br>In 2003 ______ form of the popular Skype icon ______.It was based on a simple yellow speech balloon. The icon ________ several overhauls throughout the years. The current Skype icon features the letter “S” in white color with a bright blue background. The bubbly Skype logo is based on the Arial Rounded MT Bold typeface. <b> It features the company name on a series of circles which ________ make a “cloud”. </b> The blue color in the Skype logo represents communication, prosperity and ________ of hope; whereas the white color represents peace and harmony.",

    a:[
        "collection",
        "collective",
        "collectively",
        "collect"
    ],

    correct:2,
    points:1
    },

    {id:332,sub:"Англійська мова",

    q:"<b>Skype Logo</b><br><br>In 2003 ______ form of the popular Skype icon ______.It was based on a simple yellow speech balloon. The icon ________ several overhauls throughout the years. The current Skype icon features the letter “S” in white color with a bright blue background. The bubbly Skype logo is based on the Arial Rounded MT Bold typeface. It features the company name on a series of circles which ________ make a “cloud”. <b> The blue color in the Skype logo represents communication, prosperity and ________ of hope; whereas the white color represents peace and harmony. </b>",

    a:[
        "an emotion",
        "a emotion",
        "emotion",
        "the emotion"
    ],

    correct:3,
    points:1
    }

    ];

/* 🔹 БЛОКИ */
const blocks = {
    1: [...math, ...ukr],
    2: [...history, ...eng]
};

var questions = [
    ...math,
    ...ukr,
    ...history,
    ...eng
];